Revit 2027 API
SizingOptions.SetEquivalentHeight Method
 Sets the equivalent height based on the specified width.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetEquivalentHeight(
	double fixedWidth,
	ISet<MEPSize> availableSizes
)
Public Sub SetEquivalentHeight (
	fixedWidth As Double,
	availableSizes As ISet(Of MEPSize)
)
public:
void SetEquivalentHeight(
	double fixedWidth,
	ISet<MEPSize^>^ availableSizes
)
member SetEquivalentHeight :
        fixedWidth : float *
        availableSizes : ISet<MEPSize> -> unit
Parameters
fixedWidth Double
 The new width.
availableSizes ISet<MEPSize>
 The sorted list of available sizes, where the equivalent height will be selected.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for fixedWidth must be positive. -or- The fixedWidth must be within the range of availableSizes. -or- The new size must be within the range of available sizes.
Remarks
 The equivalent height is calculated based on the specified width and the available sizes. If successful, the new width and height in the options provide the same or similar friction loss as the previous width and height.
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace